Documents/ПродажаОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПродажаОбъектовУчета</Name>
			<Comment>Регистрация факта передачи прав требования другому Контрагенту или Организации</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЖурналПроданныхДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретательПраваТребования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиИзРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЖурналПроданныхДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЖурналПроданныхДоговоров</Name>
			<Comment>В т.ч. для корректного формирования отчета в НБКИ</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриобретательПраваТребования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗавершениеРаботыОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗавершениеРаботыОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
				<xr:Item>AccumulationRegister.ИсковыеТребования</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнулитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПродажаОбъектовУчета/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьВЖурналПродажи(Отказ,Режим);
	Если не Отказ Тогда
		ВыведениеИзРаботы();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписьВЖурналПродажи(Отказ, Режим)
	
	// регистр ЖурналПроданныхДоговоров
	Движения.ЖурналПроданныхДоговоров.Записывать = Истина;
	Движения.ЖурналПроданныхДоговоров.Записать();
	Для Каждого ТекСтрокаОбъекты Из Объекты Цикл
		Движение = Движения.ЖурналПроданныхДоговоров.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектУчета = ТекСтрокаОбъекты.Объект;
		Движение.ПриобретательПраваТребования = ПриобретательПраваТребования;
	КонецЦикла;
	Движения.ЖурналПроданныхДоговоров.Записать();

КонецПроцедуры


Процедура ВыведениеИзРаботы()
	Если ВывестиИзРаботы Тогда 
		Док = Документы.ЗавершениеРаботыОрганизации.СоздатьДокумент();
		Док.Дата = Дата;
		Док.Организация = Организация;
		Док.Автор = Автор;
		Док.Объекты.Загрузить(Объекты.Выгрузить());
		Если Док.Объекты.Количество() > 0 Тогда
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
